meeTeam05/datalogger/firmware/ESP32/main/main.c
/**
 * @file app_main.c
 *
 * @brief Main Application for ESP32 IoT Bridge
 */

/* INCLUDES ------------------------------------------------------------------*/

#include <stdio.h>
#include <string.h>
#include "esp_system.h"
#include "nvs_flash.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "esp_log.h"
#include "esp_timer.h"

// Include custom libraries
#include "wifi_manager.h"
#include "stm32_uart.h"
#include "relay_control.h"
#include "json_sensor_parser.h"
#include "json_utils.h"  // JSON utility library
#include "driver/gpio.h" // For WiFi LED indicator

#ifdef CONFIG_ENABLE_MQTT
#include "mqtt_handler.h"
#endif

#ifdef CONFIG_ENABLE_COAP
#include "coap_handler.h"
#endif

/* DEFINES ------------------------------------------------------------------*/

// Status LED indicators
#define WIFI_LED_GPIO 22
#define MQTT_LED_GPIO 23

#ifdef CONFIG_ENABLE_MQTT

// Command topics
#define TOPIC_STM32_COMMAND "datalogger/stm32/command"
#define TOPIC_RELAY_CONTROL "datalogger/esp32/relay/control"
#define TOPIC_SYSTEM_STATE "datalogger/esp32/system/state"

// Data topics - JSON format
#define TOPIC_STM32_DATA_SINGLE "datalogger/stm32/single/data"
#define TOPIC_STM32_DATA_PERIODIC "datalogger/stm32/periodic/data"

#endif

/* STATIC VARIABLES ----------------------------------------------------------*/

static const char *TAG = "MQTT_BRIDGE_APP";

#ifdef CONFIG_ENABLE_MQTT
static mqtt_handler_t mqtt_handler;
#endif

#ifdef CONFIG_ENABLE_COAP
// TODO: Uncomment if you have COAP handler
// static coap_handler_t coap_handler;
#endif

// Global components
static stm32_uart_t stm32_uart;
static relay_control_t relay_control;
static json_sensor_parser_t json_parser; // Use new JSON parser

// Global state tracking
static bool g_periodic_active = false;
static bool g_device_on = false;
static bool g_mqtt_reconnected = false; // Track MQTT reconnection events

// WiFi/MQTT reconnection tracking
static uint32_t g_last_wifi_retry_ms = 0;
static bool g_wifi_disconnected_notified = false; // Track if STM32 was notified about disconnect
static uint32_t g_wifi_reconnect_time_ms = 0;     // Track when WiFi reconnected
static bool g_mqtt_started = false;               // Track if MQTT has been started (for boot stabilization)

/* STATE SYNCHRONIZATION FUNCTIONS -------------------------------------------*/

/**
 * @brief Create JSON state message
 *
 * @param buffer Buffer to store JSON string
 * @param buffer_size Size of the buffer
 *
 * @details Creates a JSON string representing the current state.
 *          Example: {"device":"ON","periodic":"OFF"}
 *          Timestamp removed to avoid confusion with milliseconds-since-boot.
 */
static void create_state_message(char *buffer, size_t buffer_size)
{
    // Create state message WITHOUT timestamp
    // Timestamp is only meaningful for sensor data (from STM32 RTC)
    // State sync doesn't need timestamp - just current status
    snprintf(buffer, buffer_size,
             "{\"device\":\"%s\",\"periodic\":\"%s\"}",
             g_device_on ? "ON" : "OFF",
             g_periodic_active ? "ON" : "OFF");
}

/**
 * @brief Publish current state via MQTT
 *
 * @details Publishes the current state to the TOPIC_SYSTEM_STATE topic
 *          with retain flag.
 */
static void publish_current_state(void)
{
#ifdef CONFIG_ENABLE_MQTT
    if (!MQTT_Handler_IsConnected(&mqtt_handler))
    {
        return;
    }

    char state_msg[256];
    create_state_message(state_msg, sizeof(state_msg));

    // Publish with retain flag so new clients get latest state
    MQTT_Handler_Publish(&mqtt_handler, TOPIC_SYSTEM_STATE, state_msg, 0, 1, 1);
    ESP_LOGI(TAG, "State published: %s", state_msg);
#endif

#ifdef CONFIG_ENABLE_COAP
    // TODO: Add COAP publish logic here if needed
#endif
}

/**
 * @brief Update global state and publish if changed
 *
 * @param device_on Current device (relay) state
 * @param periodic_active Current periodic reporting state
 *
 * @details Updates the global state variables and publishes the new state
 *          if any of the values have changed.
 */
static void update_and_publish_state(bool device_on, bool periodic_active)
{
    bool state_changed = false;

    if (g_device_on != device_on)
    {
        g_device_on = device_on;
        state_changed = true;
        ESP_LOGI(TAG, "Device state changed: %s", device_on ? "ON" : "OFF");
    }

    if (g_periodic_active != periodic_active)
    {
        g_periodic_active = periodic_active;
        state_changed = true;
        ESP_LOGI(TAG, "Periodic state changed: %s", periodic_active ? "ON" : "OFF");
    }

    if (state_changed)
    {
        publish_current_state();
    }
}

/* CALLBACK FUNCTIONS --------------------------------------------------------*/

/**
 * @brief Callback when single sensor data is received
 *
 * @param data Pointer to received sensor data
 *
 * @details Publishes single measurement data via MQTT.
 *          Called by JSON parser after validation, so data is always valid.
 */
static void on_single_sensor_data(const sensor_data_t *data)
{
    // Data is already validated by JSON parser, no need to check again

#ifdef CONFIG_ENABLE_MQTT
    // Publish full JSON data using utility function
    char json_msg[256];
    JSON_Utils_CreateSensorData(json_msg, sizeof(json_msg),
                                JSON_Parser_GetModeString(data->mode),
                                data->timestamp,
                                data->has_temperature ? data->temperature : 0.0f,
                                data->has_humidity ? data->humidity : 0.0f);

    // Publish immediately, MQTT_Handler will queue if not connected
    MQTT_Handler_Publish(&mqtt_handler, TOPIC_STM32_DATA_SINGLE, json_msg, 0, 0, 0);

    ESP_LOGI(TAG, "SINGLE: T=%.1f°C H=%.1f%%",
             data->has_temperature ? data->temperature : 0.0f,
             data->has_humidity ? data->humidity : 0.0f);
#endif

#ifdef CONFIG_ENABLE_COAP
    // TODO: Add COAP publish logic here if needed
#endif
}

/**
 * @brief Callback when periodic sensor data is received
 *
 * @param data Pointer to received sensor data
 *
 * @details Publishes periodic measurement data via MQTT.
 *          Called by JSON parser after validation, so data is always valid.
 */
static void on_periodic_sensor_data(const sensor_data_t *data)
{
    // Data is already validated by JSON parser, no need to check again

#ifdef CONFIG_ENABLE_MQTT
    // Publish full JSON data using utility function
    char json_msg[256];
    JSON_Utils_CreateSensorData(json_msg, sizeof(json_msg),
                                JSON_Parser_GetModeString(data->mode),
                                data->timestamp,
                                data->has_temperature ? data->temperature : 0.0f,
                                data->has_humidity ? data->humidity : 0.0f);

    // Publish immediately, MQTT_Handler will queue if not connected
    MQTT_Handler_Publish(&mqtt_handler, TOPIC_STM32_DATA_PERIODIC, json_msg, 0, 0, 0);

    ESP_LOGI(TAG, "PERIODIC: T=%.1f°C H=%.1f%%",
             data->has_temperature ? data->temperature : 0.0f,
             data->has_humidity ? data->humidity : 0.0f);
#endif

#ifdef CONFIG_ENABLE_COAP
    // TODO: Add COAP publish logic here if needed
#endif
}

/**
 * @brief Callback when data is received from STM32
 *
 * @param line Received data line (JSON format)
 *
 * @details Forwards received JSON data to the JSON parser.
 */
static void on_stm32_data_received(const char *line)
{
    // Don't log every data line - too verbose, STM32 UART already logs
    // ESP_LOGI(TAG, "← STM32: %s", line);

