meeTeam05/datalogger/firmware/ESP32/main/main.c
    // Parse and process JSON sensor data
    JSON_Parser_ProcessLine(&json_parser, line);
}

/**
 * @brief Callback when relay state changes
 *
 * @param state New relay state (true=ON, false=OFF)
 *
 * @details CRITICAL: This is called by relay hardware changes.
 *          We MUST update state and publish, but NEVER send commands here
 *          to avoid infinite loops.
 *
 *          When device turns OFF, periodic MUST also stop.
 *
 *          When relay toggles, STM32 gets reset, so we resend WiFi status
 *          after a delay to ensure STM32 receives it.
 */
static void on_relay_state_changed(bool state)
{
    ESP_LOGI(TAG, "Relay: %s", state ? "ON" : "OFF");

    // If device turned OFF, force periodic OFF
    bool new_periodic_state = state ? g_periodic_active : false;

    if (!state && g_periodic_active)
    {
        ESP_LOGI(TAG, "Device OFF - Periodic stopped");
    }

    // Update and publish state (this notifies web)
    update_and_publish_state(state, new_periodic_state);

#ifdef CONFIG_ENABLE_MQTT
    // CRITICAL: When relay toggles, STM32 gets reset and misses MQTT status
    // Wait 500ms for STM32 to boot, then resend current MQTT status
    vTaskDelay(pdMS_TO_TICKS(500));

    bool mqtt_connected = MQTT_Handler_IsConnected(&mqtt_handler);
    if (mqtt_connected)
    {
        STM32_UART_SendCommand(&stm32_uart, "MQTT CONNECTED");
        ESP_LOGI(TAG, "TX STM32: MQTT CONNECTED (relay toggled)");
    }
    else
    {
        STM32_UART_SendCommand(&stm32_uart, "MQTT DISCONNECTED");
        ESP_LOGI(TAG, "TX STM32: MQTT DISCONNECTED (relay toggled)");
    }
#endif
}

#ifdef CONFIG_ENABLE_MQTT
/**
 * @brief Callback when MQTT data is received
 *
 * @param topic Topic of the received message
 * @param data Message payload
 * @param data_len Length of the payload
 *
 * @details Handles commands for STM32 sensor, relay control, and state sync.
 */
static void on_mqtt_data_received(const char *topic, const char *data, int data_len)
{
    // Don't log here - MQTT handler already logs incoming messages

    // Handle STM32 commands from web
    if (strcmp(topic, TOPIC_STM32_COMMAND) == 0)
    {
        // Forward command to STM32
        if (STM32_UART_SendCommand(&stm32_uart, data))
        {
            // Update periodic state based on command (for state tracking only)
            if (strcmp(data, "PERIODIC ON") == 0)
            {
                update_and_publish_state(g_device_on, true);
            }
            else if (strcmp(data, "PERIODIC OFF") == 0)
            {
                update_and_publish_state(g_device_on, false);
            }
        }
        else
        {
            ESP_LOGE(TAG, "Failed to forward to STM32: %s", data);
        }
    }
    // Handle relay commands
    else if (strcmp(topic, TOPIC_RELAY_CONTROL) == 0)
    {
        if (Relay_ProcessCommand(&relay_control, data))
        {
            ESP_LOGI(TAG, "Relay command processed: %s", data);
        }
        else
        {
            ESP_LOGW(TAG, "Unknown relay command: %s", data);
        }
    }
    // Handle state sync requests - only on ESP32 boot or reconnect
    else if (strcmp(topic, TOPIC_SYSTEM_STATE) == 0 &&
             strstr(data, "REQUEST"))
    {
        // Only respond if MQTT just reconnected (flag set by connection handler)
        if (g_mqtt_reconnected)
        {
            ESP_LOGI(TAG, "State sync requested after reconnect");
            publish_current_state();
            g_mqtt_reconnected = false; // Clear flag after responding
        }
        else
        {
            ESP_LOGD(TAG, "Ignoring state sync request (no reconnect event)");
        }
    }
    // REMOVED: State synchronization from web to ESP32
    // Let web handle state synchronization to avoid relay bouncing
    // Web will sync its UI based on ESP32's published state
}
#endif

#ifdef CONFIG_ENABLE_COAP

// TODO: Add COAP callback functions if needed

#endif

/**
 * @brief WiFi event callback
 *
 * @param state Current WiFi state
 * @param arg User argument (not used)
 *
 * @details Logs WiFi state changes, retrieves IP/RSSI on connection,
 *          sends WiFi status to STM32, and controls WiFi LED indicator.
 */
static void on_wifi_event(wifi_state_t state, void *arg)
{
    switch (state)
    {
    case WIFI_STATE_CONNECTING:
        ESP_LOGI(TAG, "WiFi: Connecting...");
        // Turn off LED while connecting
        gpio_set_level(WIFI_LED_GPIO, 0);
        break;

    case WIFI_STATE_CONNECTED:
        ESP_LOGI(TAG, "WiFi: Connected");

        // Turn on WiFi LED indicator
        gpio_set_level(WIFI_LED_GPIO, 1);

        // Get and display IP address
        char ip_addr[16];
        if (wifi_manager_get_ip_addr(ip_addr, sizeof(ip_addr)) == ESP_OK)
        {
            ESP_LOGI(TAG, "  IP: %s", ip_addr);
        }

        // Get and display signal strength
        int8_t rssi;
        if (wifi_manager_get_rssi(&rssi) == ESP_OK)
        {
            ESP_LOGI(TAG, "  RSSI: %d dBm", rssi);
        }

        // Don't send WiFi status to STM32 - will send MQTT status instead
        g_wifi_disconnected_notified = false; // Reset disconnect flag
        break;

    case WIFI_STATE_DISCONNECTED:
        ESP_LOGW(TAG, "WiFi: Disconnected");

        // Turn off WiFi LED indicator
        gpio_set_level(WIFI_LED_GPIO, 0);

        // Don't send WiFi status to STM32 - will send MQTT status instead
        break;

    case WIFI_STATE_FAILED:
        ESP_LOGE(TAG, "WiFi: Failed (all retries exhausted)");

        // Turn off WiFi LED indicator
        gpio_set_level(WIFI_LED_GPIO, 0);

        // Don't send WiFi status to STM32 - will send MQTT status instead
        break;

    default:
        break;
    }
}

/* INITIALIZATION FUNCTIONS --------------------------------------------------*/

/**
 * @brief Initialize all components
 *
 * @return true if all components initialized successfully, false otherwise
 *
 * @details Initializes MQTT Handler, Relay Control, and JSON Parser.
 *          STM32 UART is already initialized before WiFi.
 *          Sets initial global state based on hardware.
 */
static bool initialize_components(void)
{
    bool success = true;

