meeTeam05/datalogger/firmware/ESP32/main/main.c
    // STM32 UART already initialized before WiFi (to send WiFi status)

#ifdef CONFIG_ENABLE_MQTT
    // Initialize MQTT Handler
    if (!MQTT_Handler_Init(&mqtt_handler,
                           CONFIG_BROKER_URL,
                           CONFIG_MQTT_USERNAME,
                           CONFIG_MQTT_PASSWORD,
                           on_mqtt_data_received))
    {
        ESP_LOGE(TAG, "Failed to initialize MQTT Handler");
        success = false;
    }
#endif

#ifdef CONFIG_ENABLE_COAP
    // TODO: Initialize CoAP Handler if implemented
    // if (!CoAP_Handler_Init(&coap_handler, ...))
    // {
    //     ESP_LOGE(TAG, "Failed to initialize CoAP Handler");
    //     success = false;
    // }
    ESP_LOGI(TAG, "CoAP support enabled but not implemented yet");
#endif

    // Initialize Relay Control
    if (!Relay_Init(&relay_control, CONFIG_RELAY_GPIO_NUM, on_relay_state_changed))
    {
        ESP_LOGE(TAG, "Failed to initialize Relay Control");
        success = false;
    }

    // Initialize JSON Sensor Parser
    if (!JSON_Parser_Init(&json_parser, on_single_sensor_data, on_periodic_sensor_data, NULL))
    {
        ESP_LOGE(TAG, "Failed to initialize JSON Sensor Parser");
        success = false;
    }

    // Initialize global state with actual hardware state
    g_device_on = Relay_GetState(&relay_control);
    g_periodic_active = false;

    return success;
}

/**
 * @brief Start all services/tasks
 *
 * @return true if all services started successfully, false otherwise
 *
 * @details Starts STM32 UART task, and MQTT client (only if WiFi is connected).
 */
static bool start_services(void)
{
    bool success = true;

    // Start STM32 UART task
    if (!STM32_UART_StartTask(&stm32_uart))
    {
        ESP_LOGE(TAG, "Failed to start STM32 UART task");
        success = false;
    }

#ifdef CONFIG_ENABLE_MQTT
    // DO NOT start MQTT here - will start in main loop when network is stable
    // This prevents MQTT session conflicts when ESP32 reboots
#endif

#ifdef CONFIG_ENABLE_COAP
    // TODO: Start CoAP client if implemented
    // if (!CoAP_Handler_Start(&coap_handler))
    // {
    //     ESP_LOGE(TAG, "Failed to start CoAP client");
    //     success = false;
    // }
#endif

    return success;
}

#ifdef CONFIG_ENABLE_MQTT
/**
 * @brief Subscribe to MQTT topics
 *
 * @details Subscribes to command and control topics. Called when MQTT connects.
 */
static void subscribe_mqtt_topics(void)
{
    // Subscribe to command topics
    MQTT_Handler_Subscribe(&mqtt_handler, TOPIC_STM32_COMMAND, 1);
    MQTT_Handler_Subscribe(&mqtt_handler, TOPIC_RELAY_CONTROL, 1);
    MQTT_Handler_Subscribe(&mqtt_handler, TOPIC_SYSTEM_STATE, 1);

    // Set reconnection flag to allow next REQUEST to trigger state publish
    g_mqtt_reconnected = true;

    // Publish initial state with retain flag
    publish_current_state();
}
#endif

/* MAIN APPLICATION ----------------------------------------------------------*/

void app_main(void)
{
// Disable brownout detector
// TODO: comment it if you want to enable brownout detector
#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"
    WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // Disable Brownout

    ESP_LOGI(TAG, "=== IoT Bridge Starting ===");
    ESP_LOGI(TAG, "Free heap: %lu bytes", esp_get_free_heap_size());
    ESP_LOGI(TAG, "IDF version: %s", esp_get_idf_version());

    // Initialize WiFi LED indicator GPIO
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << WIFI_LED_GPIO),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE};
    gpio_config(&io_conf);
    gpio_set_level(WIFI_LED_GPIO, 0); // Initially off
    ESP_LOGI(TAG, "WiFi LED indicator initialized on GPIO %d", WIFI_LED_GPIO);

#ifdef CONFIG_ENABLE_MQTT
    // Initialize MQTT LED indicator GPIO
    gpio_config_t mqtt_io_conf = {
        .pin_bit_mask = (1ULL << MQTT_LED_GPIO),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE};
    gpio_config(&mqtt_io_conf);
    gpio_set_level(MQTT_LED_GPIO, 0); // Initially off
    ESP_LOGI(TAG, "MQTT LED indicator initialized on GPIO %d", MQTT_LED_GPIO);
#endif

#if (CONFIG_ENABLE_MQTT || CONFIG_ENABLE_COAP)
    // Display enabled protocols
    ESP_LOGI(TAG, "Protocols enabled:");
#endif

#ifdef CONFIG_ENABLE_MQTT
    ESP_LOGI(TAG, "MQTT: (Broker: %s)", CONFIG_BROKER_URL);
#endif

#ifdef CONFIG_ENABLE_COAP
    ESP_LOGI(TAG, "CoAP: (Server: %s:%d)", CONFIG_COAP_SERVER_IP, CONFIG_COAP_SERVER_PORT);
#endif

    // Initialize NVS
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND)
    {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    ESP_LOGI(TAG, "NVS initialized");

    // Initialize event loop (required for WiFi)
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_LOGI(TAG, "Event loop initialized");

    // Initialize STM32 UART early (before WiFi) so we can send WiFi status
    ESP_LOGI(TAG, "=== Initializing STM32 UART ===");
    if (!STM32_UART_Init(&stm32_uart,
                         CONFIG_MQTT_UART_PORT_NUM,
                         CONFIG_MQTT_UART_BAUD_RATE,
                         CONFIG_MQTT_UART_TXD,
                         CONFIG_MQTT_UART_RXD,
                         on_stm32_data_received))
    {
        ESP_LOGE(TAG, "Failed to initialize STM32 UART, restarting...");
        esp_restart();
    }
    ESP_LOGI(TAG, "STM32 UART initialized successfully");

    // Initialize and connect WiFi using custom WiFi Manager
    ESP_LOGI(TAG, "=== Initializing WiFi Manager ===");
    wifi_manager_config_t wifi_config = wifi_manager_get_default_config();
    wifi_config.event_callback = on_wifi_event;
    wifi_config.callback_arg = NULL;

    // Initialize WiFi Manager
    if (wifi_manager_init(&wifi_config) != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to initialize WiFi Manager, restarting...");
        esp_restart();
    }

