meeTeam05/datalogger/firmware/ESP32/main/main.c
    // Start WiFi connection (non-blocking)
    if (wifi_manager_connect() != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to start WiFi connection");
        // Don't restart, will retry in main loop
    }
    else
    {
        ESP_LOGI(TAG, "WiFi connection started, waiting for connection...");
        // Try to wait, but don't fail if timeout
        if (wifi_manager_wait_connected(CONFIG_WIFI_CONNECTION_TIMEOUT_MS) == ESP_OK)
        {
            ESP_LOGI(TAG, "WiFi connected successfully!");
            // Mark WiFi connect time for 4-second MQTT stabilization delay
            g_wifi_reconnect_time_ms = esp_timer_get_time() / 1000;
            ESP_LOGI(TAG, "MQTT will start after 4s network stabilization delay");
        }
        else
        {
            ESP_LOGW(TAG, "WiFi initial connection timeout, will retry in background");
        }
    }

    // Initialize all components
    if (!initialize_components())
    {
        ESP_LOGE(TAG, "Failed to initialize components, restarting...");
        esp_restart();
    }
    ESP_LOGI(TAG, "All components initialized successfully");

    // Start all services (but NOT MQTT yet - will start in main loop when network stable)
    if (!start_services())
    {
        ESP_LOGE(TAG, "Failed to start services, restarting...");
        esp_restart();
    }
    ESP_LOGI(TAG, "All services started successfully (MQTT will start when network stable)");

    // Log wifi configuration details
    ESP_LOGI(TAG, "WiFi Configuration:");
    ESP_LOGI(TAG, "WiFi SSID: %s", CONFIG_WIFI_SSID);
    ESP_LOGI(TAG, "WiFi Password: %s", CONFIG_WIFI_PASSWORD);
    ESP_LOGI(TAG, "WiFi Connection Timeout: %d ms", CONFIG_WIFI_CONNECTION_TIMEOUT_MS);

    // Log hardware configuration details
    ESP_LOGI(TAG, "Hardware Configuration:");
    ESP_LOGI(TAG, "STM32 UART: Port %d, TXD=%d, RXD=%d, Baud=%d",
             CONFIG_MQTT_UART_PORT_NUM, CONFIG_MQTT_UART_TXD,
             CONFIG_MQTT_UART_RXD, CONFIG_MQTT_UART_BAUD_RATE);
    ESP_LOGI(TAG, "Relay GPIO: %d", CONFIG_RELAY_GPIO_NUM);

#ifdef CONFIG_ENABLE_MQTT
    // Log MQTT configuration details
    ESP_LOGI(TAG, "MQTT Configuration:");
    ESP_LOGI(TAG, "MQTT Broker: %s", CONFIG_BROKER_URL);
    ESP_LOGI(TAG, "Topics:");
    ESP_LOGI(TAG, "Command: %s", TOPIC_STM32_COMMAND);
    ESP_LOGI(TAG, "Relay: %s", TOPIC_RELAY_CONTROL);
    ESP_LOGI(TAG, "State: %s", TOPIC_SYSTEM_STATE);
    ESP_LOGI(TAG, "Single Data: %s", TOPIC_STM32_DATA_SINGLE);
    ESP_LOGI(TAG, "Periodic Data: %s", TOPIC_STM32_DATA_PERIODIC);
#endif

#ifdef CONFIG_ENABLE_COAP
    // TODO: Add COAP configuration details here
    // Log CoAP configuration details
    // ESP_LOGI(TAG, "CoAP Configuration:");
    // ESP_LOGI(TAG, "Server: %s:%d", CONFIG_COAP_SERVER_IP, CONFIG_COAP_SERVER_PORT);
    // ESP_LOGI(TAG, "URI Path: %s", CONFIG_COAP_URI_PATH);
#endif

#ifdef CONFIG_ENABLE_MQTT
    bool last_mqtt = MQTT_Handler_IsConnected(&mqtt_handler);
#endif

#ifdef CONFIG_ENABLE_COAP
    // TODO: Uncomment if you have COAP handler
    // bool last_coap = CoAP_Handler_IsConnected(&coap_handler);
#endif

    // Status tracking
    bool last_relay = g_device_on;
    bool last_periodic = g_periodic_active;
    bool last_wifi = wifi_manager_is_connected();

    ESP_LOGI(TAG, "Initial State: WiFi=%s, MQTT=%s, COAP=%s, Device=%s, Periodic=%s",
             last_wifi ? "Connected" : "Disconnected",
#ifdef CONFIG_ENABLE_MQTT
             last_mqtt ? "Connected" : "Disconnected",
#else
             "No Protocol",
#endif
#ifdef CONFIG_ENABLE_COAP
             // TODO: Uncomment if you have COAP handler
             //  last_coap ? "Connected" : "Disconnected",
             "No COAP",
#else
             "No Protocol",
#endif
             last_relay ? "ON" : "OFF",
             last_periodic ? "ON" : "OFF");

    // Main monitoring loop
    while (1)
    {
        bool relay_now = g_device_on;
        bool periodic_now = g_periodic_active;
        bool wifi_now = wifi_manager_is_connected();
        wifi_state_t wifi_state = wifi_manager_get_state();
        uint32_t now_ms = esp_timer_get_time() / 1000; // Convert to milliseconds

        // WiFi reconnection logic - ONLY retry if WiFi has FAILED (exhausted all retries)
        // Don't interfere while WiFi Manager is doing its own retries (CONNECTING state)
        if (wifi_state == WIFI_STATE_FAILED)
        {
            // Try to reconnect every 5 seconds (after WiFi Manager's 5 retries are exhausted)
            if ((now_ms - g_last_wifi_retry_ms) >= 5000)
            {
                ESP_LOGI(TAG, "Retrying WiFi connection...");
                wifi_manager_connect();
                g_last_wifi_retry_ms = now_ms;
            }
        }
        else if (wifi_now)
        {
            // WiFi is connected, reset retry timer
            g_last_wifi_retry_ms = now_ms;
        }

#ifdef CONFIG_ENABLE_MQTT
        bool mqtt_now = MQTT_Handler_IsConnected(&mqtt_handler);

        // WiFi state changed from connected to disconnected - STOP MQTT immediately
        if (!wifi_now && last_wifi)
        {
            ESP_LOGI(TAG, "Stopping MQTT (WiFi lost)");
            MQTT_Handler_Stop(&mqtt_handler);
            gpio_set_level(MQTT_LED_GPIO, 0); // Turn off MQTT LED
            g_wifi_reconnect_time_ms = 0;     // Reset reconnect timer
        }

        // WiFi state changed from disconnected to connected - Wait before starting MQTT
        if (wifi_now && !last_wifi)
        {
            ESP_LOGI(TAG, "WiFi restored, network stabilizing...");
            g_wifi_reconnect_time_ms = now_ms; // Mark reconnect time
        }

        // Start MQTT after 4 seconds of WiFi being stable (both on boot and reconnect)
        // Increased from 2s to 4s to ensure:
        // - DHCP assignment is complete
        // - DNS resolver is ready
        // - Network stack is fully initialized
        if (wifi_now && g_wifi_reconnect_time_ms > 0 &&
            (now_ms - g_wifi_reconnect_time_ms) >= 4000 && !mqtt_now)
        {
            uint32_t elapsed = now_ms - g_wifi_reconnect_time_ms;
            ESP_LOGI(TAG, "Starting MQTT (network stable after %u ms delay)", elapsed);
            MQTT_Handler_Start(&mqtt_handler);
            g_wifi_reconnect_time_ms = 0; // Clear timer
            g_mqtt_started = true;
        }

        // Manual reconnection with exponential backoff (since auto-reconnect is disabled)
        // This provides more control and prevents connection spam
        if (wifi_now && !mqtt_now && g_mqtt_started)
        {
            if (MQTT_Handler_Reconnect(&mqtt_handler))
            {
                ESP_LOGD(TAG, "MQTT reconnection attempt in progress");
            }
        }

        // MQTT state changed from disconnected to connected - SUBSCRIBE to topics
        if (mqtt_now && !last_mqtt)
        {
            ESP_LOGI(TAG, "MQTT connected - Subscribing...");
            gpio_set_level(MQTT_LED_GPIO, 1); // Turn on MQTT LED
            subscribe_mqtt_topics();

            // Send MQTT CONNECTED status to STM32
            STM32_UART_SendCommand(&stm32_uart, "MQTT CONNECTED");
            ESP_LOGI(TAG, "TX STM32: MQTT CONNECTED");
        }

        // MQTT state changed from connected to disconnected - Turn off LED
        if (!mqtt_now && last_mqtt)
        {
            ESP_LOGI(TAG, "MQTT disconnected");
            gpio_set_level(MQTT_LED_GPIO, 0); // Turn off MQTT LED

