meeTeam05/datalogger/firmware/ESP32/main/main.c
            // Send MQTT DISCONNECTED status to STM32
            STM32_UART_SendCommand(&stm32_uart, "MQTT DISCONNECTED");
            ESP_LOGI(TAG, "TX STM32: MQTT DISCONNECTED");
        }

        // Log status changes only
        if (relay_now != last_relay || periodic_now != last_periodic ||
            mqtt_now != last_mqtt || wifi_now != last_wifi)
        {
            ESP_LOGI(TAG, "Status: WiFi=%s, MQTT=%s, Device=%s, Periodic=%s, Heap=%lu",
                     wifi_now ? "Connected" : "Disconnected",
                     mqtt_now ? "Connected" : "Disconnected",
                     relay_now ? "ON" : "OFF",
                     periodic_now ? "ON" : "OFF",
                     esp_get_free_heap_size());
        }

        last_relay = relay_now;
        last_periodic = periodic_now;
        last_mqtt = mqtt_now;
        last_wifi = wifi_now;
#endif

#ifdef CONFIG_ENABLE_COAP
        // TODO: Uncomment if you have COAP handler
        // bool coap_now = CoAP_Handler_IsConnected(&coap_handler);
        // if (relay_now != last_relay || periodic_now != last_periodic ||
        //     coap_now != last_coap || wifi_now != last_wifi)
        // {
        //     ESP_LOGI(TAG, "Status: WiFi=%s, CoAP=%s, Device=%s, Periodic=%s, Heap=%lu",
        //              wifi_now ? "Connected" : "Disconnected",
        //              coap_now ? "Connected" : "Disconnected",
        //              relay_now ? "ON" : "OFF",
        //              periodic_now ? "ON" : "OFF",
        //              esp_get_free_heap_size());
        // }
        // last_relay = relay_now;
        // last_periodic = periodic_now;
        // last_coap = coap_now;
        // last_wifi = wifi_now;
#endif
        vTaskDelay(pdMS_TO_TICKS(200));
    }
}